#define _USE_MATH_DEFINES

#include <iostream>
#include <math.h>

using namespace std;

void Lab1(int variant)
{
	float pi = M_PI;
	float a, b, c, d, y, f, g, n, m, p, q, r, t, u, k, o, x;

	if (variant == 1) {
		cout << "======================== Вариант #1 ========================\n" << endl;
		t = 0.5; a = 2.0;
		c = a * pow(t, 2) * log(t) + pow(a, t) + exp(a * t) * cos(t);
		cout << "C = " << c << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 2) {
		cout << "======================== Вариант #2 ========================\n" << endl;
		x = 0.7; a = 0;
		cout << "Введите А: ";
		cin >> a;
		d = pow(a, x) + pow(a, 2) * x + log(a * x) + sqrt(x);
		cout << "D = " << d << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 3) {
		cout << "======================== Вариант #3 ========================\n" << endl;
		a = 2.3; b = 1.8; x = 0;
		cout << "Введите X: ";
		cin >> x;
		y = 1.5 * pow(cos(x), 2) + b * pow(a, (1.5 * x)) * x;
		cout << "Y = " << y << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 4) {
		cout << "======================== Вариант #4 ========================\n" << endl;
		x = 1.5; a = 2.5;
		b = exp(-a * x) * cos(a * x) + cbrt(fabs(x - a));
		cout << "B = " << b << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 5) {
		cout << "======================== Вариант #5 ========================\n" << endl;
		a = 0.3; b = 3.5; x = 0; f = 0;
		cout << "Введите X: ";
		cin >> x;
		f = pow(sin((x/a)), 2) + pow((b/a), x) - exp(x);
		cout << "F = " << f << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 6) {
		cout << "======================== Вариант #6 ========================\n" << endl;
		x = 0.1; a = 2.4; g = 0;
		g = (pi / pow(x, 2)) + pow(a, x) + log(a * x);
		cout << "G = " << g << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 7) {
		cout << "======================== Вариант #7 ========================\n" << endl;
		x = 0.5; a = 1.0; b = 1.3; n = 0;
		n = log(fabs(x + b * sqrt(fabs(x-a)))) + pow(a, x);
		cout << "N = " << n << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 8) {
		cout << "======================== Вариант #8 ========================\n" << endl;
		m = 0; x = 1.2; a = -3.1;
		m = a * pow(x, 2) + (a / x) + ((sqrt(pow(x, 2) + 1)) / sin(x));
		cout << "M = " << m << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 9) {
		cout << "======================== Вариант #9 ========================\n" << endl;
		x = 0.8; b = 1.3; p = 0; a = 0;
		cout << "Введите A: ";
		cin >> a;
		p = pi * x + tan(x + b * sqrt(x)) + a * pow(x, 3);
		cout << "P = " << p << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 10) {
		cout << "======================== Вариант #10 ========================\n" << endl;
		q = 0; a = 0.2; x = 0;
		cout << "Введите X: ";
		cin >> x;
		q = cos(x)/sqrt(fabs(1 + pow(a, 2) + pow(sin(x), 2)));
		cout << "Q = " << q << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 11) {
		cout << "======================== Вариант #11 ========================\n" << endl;
		a = 0; x = (pi / 15); r = 0;
		cout << "Введите А: ";
		cin >> a;
		r = a * exp(a * x) * log(a / pow(x, a));
		cout << "R = " << r << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 12) {
		cout << "======================== Вариант #12 ========================\n" << endl;
		a = 7.5; b = 1.8; d = 3; x = 0; c = 0;
		cout << "Введите X: ";
		cin >> x;
		c = 1 / (sin(x) + b) * sqrt(fabs((a * sin(x) * log(a)) / (d + a)));
		cout << "C = " << c << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 13) {
		cout << "======================== Вариант #13 ========================\n" << endl;
		x = 1.9; a = 2; b = 1.1; d = 0;
		d = log(a * pow(x, 3) + b) / exp(x + 1);
		cout << "D = " << d << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 14) {
		cout << "======================== Вариант #14 ========================\n" << endl;
		y = 0; a = 0.3; x = 0;
		cout << "Введите X: ";
		cin >> x;
		y = 0.24 * log(a*x) + a * pow(log(x), 2);
		cout << "Y = " << y << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 15) {
		cout << "======================== Вариант #15 ========================\n" << endl;
		x = 0.25; a = 1; f = 0;
		f = sin(a * x) + 3 * pow(cos(a * pow(x, 2)), 2);
		cout << "F = " << f << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 16) {
		cout << "======================== Вариант #16 ========================\n" << endl;
		x = 0; a = 0.3; b = 0.05; g = 0;
		cout << "Введите X: ";
		cin >> x;
		g = x * log((2 * x) / b) * pow(cos(b), 2);
		cout << "G = " << g << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 17) {
		cout << "======================== Вариант #17 ========================\n" << endl;
		n = 0; x = 0.25; a = 0.125;
		d = (log(a * x) / log(x + 1)) + sqrt(a + x);
		cout << "D = " << d << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 18) {
		cout << "======================== Вариант #18 ========================\n" << endl;
		x = 0; a = 0.3; p = 0;
		cout << "Введите X (Меньше 1.2): ";
		cin >> x;
		if (x >= 1.2) {
			x = 1.19;
			cout << "Значение не соответствовало требованиям -> X = 1.19" << endl;
		}
		p = log(pow(a, 2) / (1 - a)) + cos(a + x);
		cout << "P = " << p << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 19) {
		cout << "======================== Вариант #19 ========================\n" << endl;
		r = 0; x = 2.4; a = 0.4; b = 1.3;
		r = pow((b / a), x) * pow(cos(a + x), 2);
		cout << "R = " << r << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 20) {
		cout << "======================== Вариант #20 ========================\n" << endl;
		k = 0; a = 2.1; x = 0;
		cout << "Введите X: ";
		cin >> x;
		k = 0.5 * x * pow((1 + a * x), 0.2);
		cout << "K = " << k << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 21) {
		cout << "======================== Вариант #21 ========================\n" << endl;
		t = 0; x = 0.25; a = 1.5;
		t = cos(a * x) + 3 * pow(sin(a * pow(x, 3)), 2);
		cout << "T = " << t << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 22) {
		cout << "======================== Вариант #22 ========================\n" << endl;
		a = 0.3; b = 0.5; x = 0; u = 0;
		cout << "Введите X: ";
		cin >> x;
		u = x * log((2 * x) / a) * pow(sin(b), 2);
		cout << "U = " << u << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 23) {
		cout << "======================== Вариант #23 ========================\n" << endl;
		d = 0; x = 0.25; a = 0.125;
		d = (tan(a * x) / log(x + 1)) + sqrt(a + x);
		cout << "D = " << d << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 24) {
		cout << "======================== Вариант #24 ========================\n" << endl;
		k = 0; b = 0.5; x = 0;
		cout << "Введите X (Меньше 1.2): ";
		cin >> x;
		if (x >= 1.2) {
			x = 1.19;
			cout << "Значение не соответствовало требованиям -> X = 1.19" << endl;
		}
		d = tan(pow(b, 2) / (1 - b)) + sin(b * x);
		cout << "D = " << d << endl;
		cout << "\n============================================================" << endl;
	}
	else if (variant == 25) {
		cout << "======================== Вариант #25 ========================\n" << endl;
		o = 0; x = 2.5; a = 0.4; b = 1.3;
		o = pow((a / b), x) * pow(cos(x / b), 3);
		cout << "O = " << o << endl;
		cout << "\n============================================================" << endl;
	}
}