#include <iostream>

using namespace std;

void press_to_continue() {
	cout << "\n\t\tВведите любой символ, чтобы продолжить..." << endl;
}
void M_Main()
{
	system("cls");
	cout << "=======================================================================================================\n" << endl;
	cout << "\t\t\t\t1. - Открыть лабараторные (Вариант 4)" << endl;
	cout << "\t\t\t\t2. - Информация о разработчике" << endl;
	cout << "\t\t\t\t3. - Ссылки" << endl;
	cout << "\t\t\t\tQ. - Назад / Выход" << endl;
	cout << "\n=======================================================================================================" << endl;

}
void M_Labs(int l_flag)
{
	system("cls");
	cout << "=======================================================================================================\n" << endl;
	if (l_flag == 1) {
		cout << "\t\t\t\t1. - Лабараторная #2" << endl;
		cout << "\t\t\t\t2. - Лабараторная #3" << endl;
		cout << "\t\t\t\t3. - Лабараторная #4" << endl;
		cout << "\t\t\t\t4. - Лабараторная #5" << endl;
		cout << "\t\t\t\t5. - Лабараторная #6" << endl;
		cout << "\t\t\t\t6. - Лабараторная #7" << endl;
		cout << "\t\t\t\t7. - Лабараторная #8" << endl;
		cout << "\t\t\t\t9. - Далее..." << endl;
		cout << "\t\t\t\tQ. - Назад / Выход" << endl;
	}
	else if (l_flag == 2) {
		cout << "\t\t\t\t1. - Лабараторная #9" << endl;
		cout << "\t\t\t\t2. - Лабараторная #10" << endl;
		cout << "\t\t\t\t3. - Лабараторная #11" << endl;
		cout << "\t\t\t\t4. - Лабараторная #12" << endl;
		cout << "\t\t\t\t8. - Назад..." << endl;
		cout << "\t\t\t\tQ. - Назад / Выход" << endl;
	}
	cout << "\n=======================================================================================================" << endl;
}
void InformationOwn()
{
	system("cls");

	cout << "=======================================================================================================\n" << endl;
	cout << "\t\t\t\tРабота была выполнена:" << endl;
	cout << "\t\t\t\tФ.И.О. Ученика: Гирфаутдинов Антон Олегович" << endl;
	cout << "\t\t\t\tГруппа Ученика: ТИ-319" << endl;
	cout << "\t\t\t\tНомер зачетной книжки: #101230104" << endl;
	cout << "\t\t\t\tВариант выполненых заданий: 4" << endl;
	cout << "\n=======================================================================================================" << endl;

}
void OpenLinks() {
	system("cls");

	cout << "=======================================================================================================\n" << endl;
	cout << "\t\t\t\t1. - GitHub" << endl;
	cout << "\t\t\t\t2. - Профиль СибГУТИ" << endl;
	cout << "\t\t\t\t3. - VK" << endl;
	cout << "\t\t\t\t4. - ТГК" << endl;
	cout << "\t\t\t\tQ. - Назад / Выход" << endl;
	cout << "\n=======================================================================================================" << endl;

}