#include <iostream>

using namespace std;

void M_Menu() {
	system("cls");
	cout << "==========================================================================\n" << endl;

	cout << "\t1. - Сформировать матрицу методом ввода чисел" << endl;
	cout << "\t2. - Сформировать матрицу методом рандомных чисел" << endl;
	cout << "\t3. - Сформировать матрицу методом чтения из файла" << endl;
	cout << "\t4. - Получить информацию о разработчике данного РГЗ" << endl;
	cout << "\tQ. - Выйти" << endl;

	cout << "\n==========================================================================" << endl;
}


void Information() {
	system("cls");
	cout << "==========================================================================\n" << endl;

	cout << "\t\t\tВысшее учебное заведение: СибГУТИ" << endl;
	cout << "\tРаботу выполнил: Гирфаунтидинов Антон Олегович" << endl;
	cout << "\tКафедра: Телекоммуникационных сетей и вычислительной техники" << endl;
	cout << "\t\tНомер зачётной книжки: #101230104" << endl;
	cout << "\t\tГруппа: ТИ-319" << endl;
	cout << "\t\tВариант выполненной работы: #4" << endl;

	cout << "\n==========================================================================" << endl;

	cout << "\n\tQ. - Вернуться в главное меню" << endl;
}